1:WizQst1615D2
00000000
You talk to the Cretan Bull out on the Southwest Aero Plains. I'll look into Max and Eleanor's alibis.
你在西南航空平原上和克里特公牛交谈。我去查查麦克斯和埃莉诺的不在场证明。
00000001
But Ebenezer is the only one that didn't have an alibi? Well, that's getting the old gray cells a-firin'.
但埃比尼泽是唯一没有不在场证明的人吗?这让老灰色细胞兴奋起来了。
00000002
Still, can't be sure until I verify the other two alibis. While I do that, you should talk to the Cretan Bull himself. He's in a cave on the Plains.
不过，在核实其他两个不在场证明之前还不能确定。我去的时候，你应该和克里特公牛本人谈谈。他在平原上的一个山洞里。
00000003
He's probably gotten a bit paranoid since the attack, though. So you may have a fight on your hands. Watch yourself.
不过他可能自从被袭击后变得有点偏执了。所以你可能要打一场仗了。看你自己。
00000004
Mooooo!
Mooooo !
00000005
Mooooo!
Mooooo !
00000006
Uh... let me. Ahem. The Great Cretan Bull says: "who dares trespass again upon his sacred ground? These continued offenses..."
嗯…让我。嗯哼。克里特大牛说:“谁敢再侵犯他的圣地?这些持续的罪行……”
00000007
Moo!
Moo !
00000008
"...Will not be tolerated." Basically, kid, what do you want? Oh, you're investigating the attack? 'Bout time someone's doing it.
＂...是不能容忍的。”孩子，你到底想要什么?你在调查袭击案吗?是时候有人这么做了。
00000009
Moo!
Moo !
00000010
The Cretan Bull did not see his attacker, "but it bristled his brain with a vengeful brush." That don't make a lick of sense. Sorry, kid.
克里特公牛没有看到攻击他的人，“但它的脑子里刷起了复仇的刷子。”这说不通啊。对不起,孩子。
00000011
The Cretan Bull said his attacker bristled his brain with a vengeful brush? Of course! I shoulda figured it out earlier.
克里特公牛说攻击他的人用复仇的刷子刺激他的大脑?当然!我早该想到的。
00000012
Only one of the three suspects carries a brush around: the cleaning robot, Ebenezer. 
三名嫌疑人中只有一人随身携带刷子:清洁机器人埃比尼泽。
00000013
On top of that, Max and Eleanor's alibis checked out. But that dang old Aerobot never had one. I say it's time we confront the attacker.
除此之外，麦克斯和埃莉诺的不在场证明也被证实了。但那个该死的老飞行器从来没有。我觉得是时候和袭击者对质了。
00000015
Greetings, Sheriff. What can this unit buttle for you today?
问候,警长。这个单位今天能为你做什么?
00000016
The jig's up, Ebenezer. We know you attacked the Cretan Bull and you're going down for it.
好戏开始了，埃比尼泽。我们知道你袭击了克里特岛公牛，你要为此坐牢了。
00000017
Error! Attacking Cretan Bull violates the First Law of Aerobotics. This action is impossible. Searching Memory Core for verification...
错误!攻击克里特岛公牛违反了有氧运动第一定律。这种行动是不可能的。正在进行内存核验证…
00000018
Error! All data from time of Cretan Bull attack not found! Memories erased! Error! Error!
错误!没有找到克里特公牛攻击时的所有数据!记忆抹去!错误!错误!
00000019
After him, Wizard, don't let him get away!
追上他，魔法师，别让他跑了!
00000020
Error! System scans indicate anti-attack safeguards were removed. Error! User identity from time of removal erased!
错误!系统扫描显示防攻击安全措施被移除。错误!删除时删除的用户身份!
00000021
Easy now, Ebenezer, ain't nobody going to hurt you.
放松点，埃比尼泽，没人会伤害你的。
00000022
Negative! Need time to process, to recover deleted data from cache. Must find out who altered systems.
消极的!需要时间处理，从缓存中恢复被删除的数据。必须查出是谁改变了系统。
00000023
Will engage in defensive measures if processing is interrupted.
如果处理中断，将采取防御措施。
00000024
Have it your way. Get him, Wizard.
按你的方式去做。抓住他，魔法师。
00000025
System Reconstruction at 50%. Core systems... shutting... down.
系统重构在50%。核心系统……关闭……下来。
00000026
You done good, Wizard. I'll haul this pile of scrap over to the Evidence Lock-Up. Come talk to me back in town when you can.
你做得不错，魔法师。我会把这堆废料拖到证物室去。有空的时候回城里来找我谈谈。
00000027
Psst. Hey, remember me? Shhh, shh, shhh, not so loud. Don't want anyone to know I'm here.
嘘。嘿，还记得我吗?嘘，嘘，嘘，别这么大声。我不想让任何人知道我在这里。
00000028
I'm the liaison to the Cretan Bull, right? I help keep the peace between its loyal Mythies and Port Aero. 
我是克里特公牛的联络人，对吧?我帮助维持忠诚的神话和埃洛港之间的和平。
00000029
So I have a vested interest in seeing this investigation wrapped up. And... I ain't sure the robot did it.
所以我有既得利益想让调查结束。和…我不确定是机器人干的。
00000030
Sorry I didn't say anything earlier - I didn't want to get the Bull worked up - but there's something fishy here. 
对不起，我之前什么都没说——我不想激怒公牛——但这里有些可疑之处。
00000031
Don't you think it's weird Poirot didn't come talk to us right away? And why did he even suspect the bot in the first place? 
你不觉得波洛没马上跟我们说话很奇怪吗?他一开始为什么会怀疑机器人?
00000032
I think we need to access Ebenezer's Memory Core to figure out what's really goin' on. But watch your back, Wizard.
我认为我们需要进入埃比尼泽的记忆核来弄清楚到底发生了什么。但小心点，魔法师。
00000033
Well done, Wizard. We caught the varmint before he did any lasting harm. And, who knows, maybe the Cretan Bull will stand down now.
干得好，魔法师。我们在那个恶棍造成永久性伤害之前抓住了他。谁知道呢，也许克里特岛公牛现在会退出。
00000034
Cretan Bull
克利特岛的牛
00000035
Ebenezer's House
埃比尼泽的家
00000036
Cretan Bull's Den
克里特牛窝
00000037
Ebenezer
埃比尼泽
